[
  {
    "path": "posts/2021-09-10-galiwatch/",
    "title": "Operation Galiwatch",
    "description": "A citizen science project to monitor pollinators",
    "author": [
      {
        "name": "Cait Harrigan",
        "url": {}
      }
    ],
    "date": "2021-09-10",
    "categories": [
      "data viz",
      "side project"
    ],
    "contents": "\r\nMy parents are scientists. Since retiring, they’ve taken up their version of bird watching in the backyard: conducting an observational study of the birds in the backyard.\r\nThey’ve set up a bunch of sensors to collect air quality data, weather information, and timelapse images. They’re monitoring flower visits of all sorts of pollinators, such as bees and humming birds. If all goes well with the infrared camera, maybe even bats.\r\nI’ve been helping them out with some data analysis and visualizations. I’m putting together a data dashboard, and I set up the Galiwatch website. We’re collaborating with the folks at Biodiversity Galiano and IMERSS to make low-cost, hyperlocal ecosystem and climate monitoring accessible for other citizen scientists!\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-09-10-galiwatch/preview.jpg",
    "last_modified": "2021-09-13T20:27:06-04:00",
    "input_file": {}
  },
  {
    "path": "posts/needs-review/2021-11-08-undergraduate-research-at-uoft/",
    "title": "Undergraduate research at UofT",
    "description": "Links to some pretty sweet resources, stuff to know when looking for research positions, and some observations",
    "author": [
      {
        "name": "Cait Harrigan",
        "url": {}
      }
    ],
    "date": "2021-09-08",
    "categories": [
      "soap box"
    ],
    "contents": "\r\n\r\nContents\r\nResources for undergraduate research\r\nResearch comes in many shapes and sizes\r\nChoose a lab\r\nDon’t work for free!\r\nWhat to expect in the research environment\r\nHow important is it to publish in undergrad?\r\n\r\nResources for undergraduate research\r\nBefore I launch into my own thoughts, I must promote some of the excellent advice that others have compiled. This is a small selection of my personal favourites, but many of them link out to even more resources. This list is aimed primarily at students interested in computational biology & ML - and the rest of the post will follow suit.\r\nRUCS and their fabulous Undergraduate Research Guide\r\nThe BCBSU hosts and annual information session on research courses BCB330 & BCB430\r\nTips on finding a supervisor from the BCB program\r\nProject X machine learning research competition\r\nResearch comes in many shapes and sizes\r\nAs usual, I will apply the disclaimer that I am only speaking from my own experience, and it’s been a while since I was doing undergraduate research myself, so no guarantees that things are the same as they once were.\r\nAs an undergrad, I was in the Bioinformatics and Computational Biology program at UofT, 2015-2019. As part of the requirements for that program, there are two research project courses; BCB330 and BCB430. There are many similar courses offered through a variety of programs, such as ROPs, capstone projects, independent research projects, etc. Most of these are blank-cheque style courses you get credit for by working with a professor in a research capacity.\r\n\r\nOften, you don’t have to be enrolled in a program to take their research course. You can inquire into research offerings in departments such as CSC, STA, MGY, BCH, CSB, and more.\r\nSometimes you can get a paid research position, supported by a USRA grant. It’s a big frustration of mine that I didn’t know about USRA’s until it was too late. These are grants offered by the Canadian government to support and encourage labs to hire undergraduate students for summer research positions. Don’t apply on your own! The proposal expectations are particular, and field-specific. Ask your mentor for help with crafting the application.\r\nChoose a lab\r\nMost departments have a list of faculty, this is a good place to start. Survey the landscape of professors that you might work with by skimming through their google scholar profile. An easy way to find more, similar labs is to click through their co-authors.\r\nFor an interdisciplinary field such as computational biology, I found it useful to look through the faculty pages of multiple departments, various hospital labs, and start-ups that I knew my peers had done research or PEY at.\r\n# Cold contacting\r\nThere are many resources out there for how to compose the dreaded “cold email”, some that I’ve already listed. Briefly, here is the anatomy of the cold emails I have sent:\r\nintroduce yourself\r\nexplain what kind of position your looking for\r\nmention one thing in their recent publication record or lab website that made their lab stick out to you\r\ndescribe any relevant past experience you have\r\nask for an interview\r\nattach a cover letter (optional, the email itself may serve as this)\r\nattach your CV\r\nattach your transcripts\r\nAttach your transcripts even if you think they look bad. (I certainly felt this way!) This will increase the likelihood that you hear back and make things go faster. The grades themselves are not usually particularly important, but attaching the transcript is a simple indicator that you understand what this type of email should contain.\r\nProfessors are often very busy, and often bad at responding to emails. Send these emails out in batches, and if you don’t hear back from anyone after about a week, follow up or move on. Radio silence is common, so don’t be discouraged by it.\r\nDon’t work for free!\r\nI’ll say it again: don’t work for free!\r\nThis seems to be more of a problem in the wet-lab world than computational labs, but even so I have seen instances of students being taken advantage of via “unpaid internships” or “laboratory volunteer” positions. For one thing, this is not legal in Canada. Perhaps more significantly, it’s a big red flag that your work is not being valued as it should be. Chances are that there is a more suitable position out there for you that will serve you better, and compensate you fairly.\r\nYou should either get course credit, or a paycheck for your time. (If you can swing it, get both!) Don’t underestimate the value of your contributions as an undergraduate researcher. Potentially getting authorship on a publication is not payment.\r\nWhat to expect in the research environment\r\nI divide labs into two categories: New PI/Old PI. A New PI is someone who has recently started their lab, they are not super established yet, their group is small, they probably don’t have a ton of extra money to spend on paying you. This environment will be good for a course-credit experience, or one where you “bring” your own funding (ex. through a USRA). Although you may be working with a grad student, this PI will probably be more hands-on, and could be directly involved in your project and giving you guidance.\r\nOld PI has seen it all. They are well established, their group is large, and they have lots of high-impact publications. They might have grant money to straight out hire you as an intern. A grad student will be your direct supervisor, and you might not meet with Old PI very frequently.\r\nObviously the New PI/Old PI caricature is not all-encompassing, and every environment will have its own peculiarities, advantages, and disadvantages. In all cases you will most likely have a chance to interact with grad students, and find out what makes them so dang jaded. You will get to attend (often weekly scheduled) group meetings, and possibly be expected to present your work to the lab at group meeting.\r\nIn the most general of terms, the grading for research project courses is relatively lax. Often there is a performance evaluation that your supervisor has to fill out at the end, plus some written or presentation-based deliverable. Many labs mark pretty easy, as long as you fulfill the minimum expectations of showing up and trying hard.\r\nAgain: No guarantees! Your PI may be a tough marker.\r\nHow important is it to publish in undergrad?\r\nDepends on your exact field, but my feeling is: it’s not super important. At the undergraduate level, having a publication is less significant than having refined research skills, and being able to describe the work you have done. Research ability is something that tends to come through in an interview, but less clearly on paper. Depending on what kinds of applications you foresee in your future, a publication may be more or less valuable to you.\r\nOf course, a useful skill to have is experience in publishing and communicating results. The best kind of research experience is one where you learn a lot, and get to contribute to a publication. However, this is not usually guaranteed. If the project as a whole is not yet at a place where you can submit to a conference or journal, something you can do at the end of a research experience to make it go a little further is to submit to an undergraduate journal or poster session. Leave a couple weeks at the end of your research experience for developing a write up or poster, and ask your mentor for input. With an end product that you deliver in someway to an audience, you will gain a lot more out of your experience, and make it much easier to write about on your CV.\r\nSome examples of UofT student journals are: Arbor, JULS, RUCS. There are several undergraduate research conferences and poster competitions run by various departments, often associated with their respective project courses. The ASSU hosts an annual undergraduate research conference. You can apply to have your research appear in similar venues at other institutes, or if you’re particularly ambitious, grab some friends and host your own research day. There are a lot of options for turning course work into an opportunity for research dissemination.\r\nMany academic CVs have a “research dissemination” (or equivalent) section. Regardless of whether it was peer reviewed: a publication, presentation, or poster can be a valuable line for you to add to your CV. I like to this of it as similar to the “projects” section that an industry CV might contain.\r\n\r\n\r\n\r\n",
    "preview": "posts/needs-review/2021-11-08-undergraduate-research-at-uoft/gerstein interior heritage.jpg",
    "last_modified": "2021-09-15T14:53:52-04:00",
    "input_file": {}
  },
  {
    "path": "posts/needs-review/2021-08-28-gradschool-secrets/",
    "title": "Gradschool secrets",
    "description": "Things to know when appling to gradschool: how to pick a graduate program, and what professors are looking for in prospective students.",
    "author": [
      {
        "name": "Cait Harrigan",
        "url": {}
      }
    ],
    "date": "2021-08-28",
    "categories": [
      "gradschool",
      "soap box"
    ],
    "contents": "\r\n\r\nContents\r\nDisclaimer\r\nWhat to consider when choosing a program\r\nGraduate programs are not like undergrad\r\nMasters to PhD vs Direct Entry\r\nPooled entry vs assigned advisor\r\nProgram requirements\r\n\r\nWhat to consider when choosing a lab\r\nRead past work\r\nTalk to current students\r\nInterview the professor\r\n\r\nThings that may affect your acceptance chances, that have nothing to do with the application\r\nPre-established relationships with faculty members\r\nPeople don’t recognize your school name\r\nSomeone called “dibs” on you\r\nSomething random in your CV appeals to the reader\r\nSheer randomness\r\n\r\n\r\nPretty much every student-academic website I see has some version of this post. There are two things that I think drive this fact.\r\nMany academic website themes include a blog section, which makes people feel like they should write something in it. Gradstudents write what they know, and what they know is gradschool.\r\nWe’re still reeling from the application process. It’s confusing, and varies wildly from school-to-school, or even between departments at the same school. Most undergrads have a nebulous understanding of what the people reading their application are looking for, and the process can be heavily influenced by having existing relationships with professors in program.\r\nTo me, this second remark is glaring. It points to an accessibility issue for prospective students that don’t have gradstudents or professors they can reach out to to get advice on applying1. Now that applying to gradschool is in my rearview mirror, I know a bunch of secrets that I will share with you.\r\nDisclaimer\r\nTo remark #1: I’m writing what I know. What I’ve learned may only be applicable to the Canadian university experience (although I suspect much of it could be extended to the US). This advice is in general aimed towards students applying to computational, research-based graduate programs. It’s more or less a compilation of answers to common questions I’ve been asked over the last few years. However, these answers come from my personal experiences and may be particular to my career path. Take away what is useful, and leave the rest!\r\nWhat to consider when choosing a program\r\nIn my opinion, while some programs have nice benefits that others don’t, the lab group and advisor that you work with will make a much bigger impact on your grad school experience. Put high weight on who is part of the program, in addition to what the program offers.\r\nGraduate programs are not like undergrad\r\nAs a grad student, you will have a direct advisor, who is going to invest time into your progress. Because of this, faculty members have a lot more say in who is admitted to a grad program than undergrad.\r\nIn some ways, the bar to get into a grad program may be lower than undergrad. There is generally more wiggle room on grades, and previous research experience counts for a lot. You really only have to convince a professor that you are someone who will be a good fit for their group, and who will learn how to be a researcher.\r\nAll this being said, the number one thing you should do when applying to grad school is reach out to professors you might end up working with.\r\nAdjust your expectations. There is a decent chance that you can get admitted to a higher caliber graduate program than you might think. Aim high, and apply to at least one “reach” (ideally more than one).\r\nMasters to PhD vs Direct Entry\r\nThe question on whether to do a Masters program with intent to transfer into a PhD, vs direct entry PhD comes up a lot. In my opinion, it doesn’t matter. There seems to be some idea that direct entry is somehow more prestegious than MSc to PhD (maybe because the minimum requirements are different?). No one I’ve met cares about this at all.\r\nI will comment that a direct entry PhD is often a >5 year program. This is a big commitment! I did a MSc to PhD transition, and I really appreciated having an opportunity at the end of the masters to reflect on whether research was something I really wanted to continue with. (it is!)\r\nOn the other hand, masters projects are often relatively small. You won’t get your research rolling in the same way you would in a direct entry program.\r\nPooled entry vs assigned advisor\r\nMany times you will be admitted into a program, and not assigned an advisor right away. I call this “pooled entry”. There are benefits to this: lots of programs have a rotation year, to let you try out different labs, then you pick one you like. However, there is the risk that you don’t end up with an advisor you want to work with, and it kind of sucks to spend a whole year in a program, only to find out that things don’t go your way in this respect.\r\nAt UofT, the Computer Science department takes the other approach: you will not be accepted into the program unless there is a specific professor who is willing to fund you. This means that you know right away when you’re accepted who your advsor will be. I liked this because it let me start researching earlier.\r\nWith the exception of the theory group within computer science, who do a rotation year.\r\nProgram requirements\r\nThink about what your program will make you do. What kinds of courses will you be required to take? What will you be missing out on? You can of course always pick up a textbook and run a course for yourself, but if you’re anything like me, that’s not going to happen.\r\nPick a program that will require you to learn the things that you want to learn over the course of your degree.\r\nWhat to consider when choosing a lab\r\nRead past work\r\nSurvey to find out not only what areas of expertise your potential advisor has, but also what kinds of projects they are able to support. What venues do they publish in? Who are their frequent collaborators? What datasets do they tend to favour?\r\nLook out for indicators of what habits you might pick up from the lab. Do they publish reproducible work? Is their github beautiful? Do new papers get a tweetorial?\r\nTalk to current students\r\nThe reason for this is two fold: firstly, current students know the most and they know it now. Information about a lab tends to expire quickly, as members leave and join. Current students are in the loop, and will (almost always) give you honest and helpful answers to your questions.\r\nSecondly, if you join their lab, these current students will be your peers and your mentors. Think about probing questions you can ask that will give you a sense of their style, as well as to learn more about the lab in general.\r\nWhat do they like about the institute? What do they dislike? What courses do they recommend? What are the strengths and weaknesses of their advisor? What is the lab culture like? Who do they talk to when they’re stuck on a problem? How independently are they expected to conduct their work? How often do they meet with their advisor? How hands on is the advisor? Do they have a co-advisor, and how do they manage that relationship? What does their advisor do to support them outside of their research?\r\nIn my experience, lab culture is really important. Having both casual and professional access to senior students has definitively shaped how I approach research.\r\nInterview the professor\r\nI like to think of grad school as an apprenticeship. Your advisor is not your boss, so much as a mentor and will inevitably shape you into being the kind of researcher that they are. Think about whether their style is something you want to emulate. What attributes do they exhibit that you might pick up on? What and they habits and values will they instill in you?\r\nSome questions I really like to ask are:\r\n\r\nLab direction: what vision do you have for your lab in the next 5 years? What big-picture problems are you tackling?\r\n\r\nThis is the kind of question that professors have to address when writing grants, so they should have an answer.\r\n\r\nWhat do you do to foster a positive lab culture?\r\n\r\nThis will be revealing as to whether your potential advisor actively cultivates a supportive environment.\r\n\r\nWhat makes for a truly excellent grad student?\r\n\r\nThis will give you an idea of their expectations, and also probably some useful advice!\r\nIf you get any really great advice, consider sharing it with me so I can add it to my previous post about this question 😄\r\nThings that may affect your acceptance chances, that have nothing to do with the application\r\nThis section is still in rough shape\r\n(Aka: the myth of meritocracy)\r\nThere are a handful of external factors that might affect the chances of your application being accepted. Some of them may be more or less exaggerated based on the type of pool you apply to.\r\nPre-established relationships with faculty members\r\nUnsurprisingly, having connections is useful. Even a very simple introductory email can go a long way. Here are some things you can do to build a relationship with professors, some of whom might have a hand in admitting you, and all of whom will have useful advice for your application. Some of these things have to be done >12 months in advance of considering graduate programs, which can be daunting. However, many of them will arise naturally for you in some way, so I hope that this list will help make you aware of instances where you could be taking advantage of an opportunity presenting itself.\r\nFrom least investment to most:\r\nCold email\r\nreach out to faculty, ask for informational interview, have some portforlio of past work to show off/talk about\r\n\r\nGet to know them through taking their class\r\ndepending on the size of your classes, this may be more or less feasible\r\nI went to grad school at the same institute that I did my undergrad at and this was feasible for my bachelors thesis course\r\nHowever most of my other classes had hundreds of people in them and close to zero chance of interacting with faculty. This made getting reference letters challenging.\r\n\r\nNetwork at events/conferences\r\nit’s hard for undergrads to do this, but if you have the warewithal to, excellent.\r\na lot more obtainable for masters students\r\n\r\nSummer internship\r\nespecially if you’re coming from industry, you can be a real asset to hire into a lab tech position\r\nthis is a good way to get to know your research environment, or make connections with the peers of the faculty you want to work with.\r\n\r\nCollaborate\r\nreally good if you’re coming from masters\r\nalso good if you’re based in a different country from where you’re applying to\r\n\r\nPeople don’t recognize your school name\r\nmore of a problem in the states, apparently smaller schools in canada are attributed higher pedigree than small schools in the states\r\nSomeone called “dibs” on you\r\ncould come into play in the pooled entry format, to improve your chances\r\nfaculty at location A might have friends at another institution B you’re applying to. If prof at B mentions they really want you, prof at A might not try too hard to recruit you.\r\nSomething random in your CV appeals to the reader\r\nmaybe you are an avid skateborder or bird watcher or did a side project that a prof did very similar work on. Maybe there is shared educational history or …  . Don’t discount the human factor behind the application.\r\ngood to have a cohesive story about yourself that shines through, but sometimes there is a small random detail that makes you memorable.\r\nSheer randomness\r\nidk dude\r\n\r\nFeel free to reach out to me for advice, I am happy to be your gradschool friend↩︎\r\n",
    "preview": "posts/needs-review/2021-08-28-gradschool-secrets/preview.png",
    "last_modified": "2021-09-15T19:36:48-04:00",
    "input_file": {},
    "preview_width": 1050,
    "preview_height": 600
  },
  {
    "path": "posts/2021-05-04-how-to-be-a-good-grad-student/",
    "title": "How to be a good grad student",
    "description": "What makes for a truly excellent grad student? I surveyed my mentors, here's what they had to say.",
    "author": [
      {
        "name": "Cait Harrigan",
        "url": {}
      }
    ],
    "date": "2021-05-04",
    "categories": [
      "gradschool",
      "soap box"
    ],
    "contents": "\r\nOver the last year, I have been asking various people this question:\r\n\r\nWhat makes for a truly excellent grad student?\r\n\r\nI highly recommend you put this question to the people in your life that you work with, and admire. So far, I’ve recieved thoughtful answers, but the question often seems to takes people by surprise. This is funny to me because it makes me think that although a lot of grad students seem to be concerned with getting feedback on “am I doing a good job?” they aren’t asking for help on how to do a good job.\r\nObviously you can substitute “grad student” with whatever your position is. I think this is a valuable question in general for getting perspective on what skills and behaviours you should be investing your time into.\r\nHere are some of my favourite responses from the people I asked:\r\nThey read a lot. They survey the field and have a good understanding of what’s out there and how their work fits within the context of the research landscape, and how their work is driving the field forward.\r\nThey are someone who focuses on what the big-picture impact of their project is, and thinks about the ultimate results and their significance.\r\nThey are a good communicator. They can write clearly, and they can explain their ideas.\r\nThey know how to make use of their advisor. Often, there are things that an advisor knows a simple answer to, that students don’t find out about just because they didn’t ask.\r\nDid you get a good answer to this question? Create an issue if you’d like to share it, and I’ll add it to my list 🌻\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-04-how-to-be-a-good-grad-student/preview.jpg",
    "last_modified": "2021-09-13T22:10:21-04:00",
    "input_file": {}
  },
  {
    "path": "posts/consider-uncertainty/",
    "title": "Considerations for Visualizing Uncertainty",
    "description": "Workshop paper presented at CHI 2021",
    "author": [],
    "date": "2021-05-01",
    "categories": [
      "data viz",
      "clinical ml"
    ],
    "contents": "\r\n\r\n\r\na.button{\r\n  display:inline;\r\n  padding:0.35em 1.2em;\r\n  border:0.1em solid #0F2E3D;\r\n  margin: 1.2em 0em 0em 0.3em;\r\n  border-radius: 0.25rem;\r\n  box-sizing: border-box;\r\n  text-decoration:none;\r\n  font-family: 'Open Sans', sans-serif;\r\n  font-weight:400;\r\n  font-size: 1.3em;\r\n  color: #0F2E3D;\r\n  text-align:center;\r\n  transition: all 0.2s;\r\n}\r\n\r\na.button:hover{\r\n color:#FFFFFF;\r\n background-color:#0F2E3D;\r\n}\r\n\r\n\r\npaper\r\n\r\nKey Ideas\r\nDisplaying uncertainty when visualizing a model output increases trust in the prediction\r\nClinicians are a unique user group because they interpret predictions by examining raw features alongside model output\r\nCitation\r\nCaitlin F Harrigan*, Gabriella Morgenshtern*, Anna Goldenberg, and Fanny Chevalier. “Considerations for Visualizing Uncertainty in Clinical Machine Learning Models”. Workshop: Realizing AI in Healthcare: Challenges Appearing in the Wild, CHI 2021 Online Virtual Conference (originally Yokohama, Japan), May. 2021.\r\n* Equal contribution\r\n\r\n\r\n\r\n",
    "preview": "posts/consider-uncertainty/preview.png",
    "last_modified": "2021-09-17T18:09:25-04:00",
    "input_file": {},
    "preview_width": 1491,
    "preview_height": 541
  },
  {
    "path": "posts/2020-03-21-advice-a-postdoc-gave-me/",
    "title": "Advice a postdoc gave me",
    "description": "Simple tips for computational biologists",
    "author": [
      {
        "name": "Cait Harrigan",
        "url": {}
      }
    ],
    "date": "2020-03-21",
    "categories": [
      "gradschool",
      "soap box"
    ],
    "contents": "\r\nThis article got posted in my lab’s slack. It claims the folowing:\r\n\r\nConventional wisdom in the laboratory sciences suggests that PhD students develop their research skills as a function of mentorship from their faculty advisors (i.e., principal investigators; PIs). However, no prior research has identified empirically a relationship between specific PI practices and the development of research skills. Here we show that PIs’ laboratory and mentoring activities do not significantly predict students’ skill development trajectories, but the engagement of postdocs and senior graduate students in laboratory interactions do. These findings support the practice of “cascading mentorship” as differentially effective and identify a critical but previously unrecognized role for postdocs in the graduate training process. They also illustrate both the importance and the feasibility of identifying evidence-based practices in graduate education.\r\n\r\nA postdoc in my lab responded, with their wisdom:\r\nuse tmux\r\nuse Snakemake\r\nuse Pycharm\r\nuse zsh\r\ndon’t use Jupyter Notebooks\r\nuse conda environments\r\nThis list has served me well so far. To add some wisdom of my own:\r\nalways write a readme\r\nuse wandb\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-03-21-advice-a-postdoc-gave-me/preview.jpg",
    "last_modified": "2021-09-15T14:19:46-04:00",
    "input_file": {}
  },
  {
    "path": "posts/tracksigfreq/",
    "title": "TrackSigFreq",
    "description": "In: Proceedings of the Pacific Symposium on Biocomputing, January 2020",
    "author": [],
    "date": "2020-03-02",
    "categories": [
      "cancer evolution",
      "machine learning",
      "peer reviewed"
    ],
    "contents": "\r\n\r\n\r\na.button{\r\n  display:inline;\r\n  padding:0.35em 1.2em;\r\n  border:0.1em solid #0F2E3D;\r\n  margin: 1.2em 0em 0em 0.3em;\r\n  border-radius: 0.25rem;\r\n  box-sizing: border-box;\r\n  text-decoration:none;\r\n  font-family: 'Open Sans', sans-serif;\r\n  font-weight:400;\r\n  font-size: 1.3em;\r\n  color: #0F2E3D;\r\n  text-align:center;\r\n  transition: all 0.2s;\r\n}\r\n\r\na.button:hover{\r\n color:#FFFFFF;\r\n background-color:#0F2E3D;\r\n}\r\n\r\n\r\npaper code\r\n\r\n\r\nKey Ideas\r\nBoth variant allele frequency (VAF) and mutational signatures are useful for identifying subclonal cell populations\r\nTrackSig is easily extensible to account for VAF when detecting subclonal evolution\r\nCitation\r\nCaitlin F Harrigan, Yulia Rubanova, Quaid Morris, and Alina Selega. “TrackSigFreq : subclonal reconstructions based on mutation signatures and allele frequencies”. In: Pacific Symposium on Biocomputing 25 (2020), pp. 238-249.\r\n\r\n\r\n\r\n",
    "preview": "posts/tracksigfreq/preview.png",
    "last_modified": "2021-09-13T20:27:13-04:00",
    "input_file": {},
    "preview_width": 850,
    "preview_height": 488
  },
  {
    "path": "posts/tracksig/",
    "title": "TrackSig",
    "description": "In: Nature Communications, February 2020",
    "author": [],
    "date": "2020-02-27",
    "categories": [
      "cancer evolution",
      "machine learning",
      "peer reviewed"
    ],
    "contents": "\r\n\r\n\r\na.button{\r\n  display:inline;\r\n  padding:0.35em 1.2em;\r\n  border:0.1em solid #0F2E3D;\r\n  margin: 1.2em 0em 0em 0.3em;\r\n  border-radius: 0.25rem;\r\n  box-sizing: border-box;\r\n  text-decoration:none;\r\n  font-family: 'Open Sans', sans-serif;\r\n  font-weight:400;\r\n  font-size: 1.3em;\r\n  color: #0F2E3D;\r\n  text-align:center;\r\n  transition: all 0.2s;\r\n}\r\n\r\na.button:hover{\r\n color:#FFFFFF;\r\n background-color:#0F2E3D;\r\n}\r\n\r\n\r\npaper code\r\n\r\n\r\nKey Ideas\r\nOrder mutations by pseudotime: every cell contains all the mutations of its ancestors\r\nSubclonal evolution can be observed by detecting changes in mutational processes\r\nCitation\r\nYulia Rubanova, Ruian Shi, Caitlin F Harrigan, Roujia Li, Jeff Wintersinger, Nil Sahin, Amit Deshwar, and Quaid Morris. “Reconstructing evolutionary trajectories of mutation signature activities in cancer using TrackSig”. En. In: Nature Communications 11.1 (Feb. 2020). Number: 1 Publisher: Nature Publishing Group, pp. 1-12.\r\n\r\n\r\n\r\n",
    "preview": "posts/tracksig/preview.png",
    "last_modified": "2021-09-13T20:27:13-04:00",
    "input_file": {},
    "preview_width": 1612,
    "preview_height": 636
  }
]
