[
  {
    "path": "posts/tracksig/",
    "title": "TrackSig",
    "description": "In: Nature Communications, February 2020",
    "author": [],
    "date": "2019-12-12",
    "categories": [
      "cancer evolution",
      "mutational signatures",
      "machine learning"
    ],
    "contents": "\r\n\r\n\r\na.button{\r\n  display:inline;\r\n  padding:0.35em 1.2em;\r\n  border:0.1em solid #0F2E3D;\r\n  margin: 1.2em 0em 0em 0.3em;\r\n  border-radius: 0.25rem;\r\n  box-sizing: border-box;\r\n  text-decoration:none;\r\n  font-family: 'Open Sans', sans-serif;\r\n  font-weight:400;\r\n  color: #0F2E3D;\r\n  text-align:center;\r\n  transition: all 0.2s;\r\n}\r\n\r\na.button:hover{\r\n color:#FFFFFF;\r\n background-color:#0F2E3D;\r\n}\r\n\r\n\r\npaper code\r\n\r\n\r\nKey Ideas:\r\nOrder mutations by pseudotime: every cell contains all the mutations of its ancestors\r\nSubclonal evolution can be observed by detecting changes in mutational processes\r\nCitation\r\nYulia Rubanova, Ruian Shi, Caitlin F Harrigan, Roujia Li, Jeff Wintersinger, Nil Sahin, Amit Deshwar, and Quaid Morris. “Reconstructing evolutionary trajectories of mutation signature activities in cancer using TrackSig”. En. In: Nature Communications 11.1 (Feb. 2020). Number: 1 Publisher: Nature Publishing Group, pp. 1-12.\r\n\r\n\r\n\r\n",
    "preview": "posts/tracksig/preview.png",
    "last_modified": "2021-08-29T16:17:42-04:00",
    "input_file": {},
    "preview_width": 1050,
    "preview_height": 600
  },
  {
    "path": "posts/2016-08-29-gradschool-secrets/",
    "title": "Gradschool secrets",
    "description": "Things to know when appling to gradschools: how to pick a graduate program, and what professors are looking for in prospective students.",
    "author": [],
    "date": "2016-08-29",
    "categories": [
      "gradschool",
      "learned the hard way"
    ],
    "contents": "\r\n\r\nContents\r\nDisclaimer\r\nHow to pick a program\r\nGraduate programs are not like undergrad\r\nMasters to PhD vs direct entry\r\nEntry pool vs assigned supervisor\r\n\r\nHow to pick a lab\r\nRead past work\r\n\r\nThings that will make your application stronger\r\nHave a relationship with a current faculty memeber\r\n\r\nHow to mitigate the accessibility issue\r\n\r\nPretty much every student-academic website I see has some version of this blog post. There are two things that I think drive this fact.\r\nMany academic website themes include a blog section, which makes people feel like they should write something in it. Gradstudents write what they know, and what they know is gradschool.\r\nWe’re still reeling from the application process. It’s confusing, and varies wildly from school-to-school, or even between departments at the same school. Most undergrads have a nebulous understanding of what the people reading their application are looking for, and the process can be heavily influenced by having existing relationships with professors in program.\r\nTo me, this second remark is glaring. It points to an accessibility issue for prospective students that don’t have gradstudents or professors they can reach out to to get advice on applying 1 . Now that applying to gradschool is in my rearview mirror, I know a bunch of secrets that I will with you.\r\nDisclaimer\r\nTo remark #1: I’m writing what I know. What I’ve learned may only be applicable to the Canadian university experience (although I suspect much of it could be extended to the US). This advice is in general aimed towards students applying to research-based graduate programs. However, my opinions come from my personal experiences and may be particular to my career path. Take away what is useful, and leave the rest!\r\nThe views expressed here are my own, and not endorsed by any organizations that I am affiliated with.\r\nHow to pick a program\r\nGraduate programs are not like undergrad\r\nThe rules are different, the culture is different Believe in yourself. Gradschool is different from undergrad abecause the bar is lower to get in.\r\nMasters to PhD vs direct entry\r\nEntry pool vs assigned supervisor\r\nHow to pick a lab\r\nRead past work\r\nDo this to find out what kinds of projects the prof can support. ### Talk to current students What classes did they take? What are the strengths and weaknesses of the prof? What is the lab culture like? Who do they talk to when they’re stuck? How independently do they work? How often do they meet with the prof and how hands on are they? What does the prof do to support them outside of their research?\r\nThink about who else is in the lab. What senior students will be available to mentor you?  + postdocs are important article ### Interview the professor Your prof is not your boss. THey are an advisor and mentor and will inevitable shape you into they kind of researcher that they are. THinnk about whether their style is somehting you want to model. THinka about the attributes that they exhibit that you might pick up on and they habits/values they will instill on you. #### Lab direction #### What do you do to foster good lab culture? ####\r\nThings that will make your application stronger\r\nHave a relationship with a current faculty memeber\r\nCold email\r\ninformational interview, have some portforlio to show off/talk about #### Work with them over the summer #### Go to conferences\r\nI went to grad school at the same institute that I did my undergrad at. My background is This post is\r\nI had a really rich set of opportunities available to me as an undergraduate\r\nUofT is big. getting reference letters is hard.\r\nThe views expressed here are my own, and not endorsed by any organizations that I am affiliated with.\r\nHow to mitigate the accessibility issue\r\n\r\nFeel free to reach out to me for advice, I am happy to be your gradschool friend↩︎\r\n",
    "preview": "posts/2016-08-29-gradschool-secrets/preview.png",
    "last_modified": "2021-08-29T15:18:17-04:00",
    "input_file": {},
    "preview_width": 1050,
    "preview_height": 600
  }
]
